Repository: nirgoldberg/advanced-woocommerce-products-filter
Catalog: lang/awpf-*.po
Languages: he_il

source: Advanced WooCommerce Products Filter
he_il: סינון מוצרים

source: Products Filter
he_il: סינון מוצרים

source: Products Filter Dashboard
he_il: לוח בקרה סינון מוצרים

source: Dashboard
he_il: לוח בקרה

source: What's New
he_il: מה חדש

source: Changelog
he_il: ריכוז שינויים

source: Products Filter Settings
he_il: הגדרות סינון מוצרים

source: Settings
he_il: הגדרות

source: Welcome to Advanced WooCommerce Products Filter
he_il: ברוכים הבאים לסינון מוצרים

source: Thank you for installing AWPF %s! We hope you like it.
he_il: תודה רבה שהתקנתם את התוסף AWPF %s! אנו מקווים שתאהבו אותו.

source: Advanced WooCommerce Products Filter Settings
he_il: הגדרות סינון מוצרים

source: Product Categories
he_il: קטגוריות מוצרים

source: Add WooCommerce products filter, based on price and product custom taxonomies
he_il: הטמעת מסנני מוצרים, המבוססים על מחיר ומאפייני מוצרים

source: Title
he_il: כותרת

source: Taxonomy
he_il: מאפיין

source: Remove
he_il: הסר

source: Show Product Categories Menu
he_il: הצג תפריט קטגוריות מוצרים

source: Show Price Filter
he_il: הצג סינון על פי מחיר

source: Price Filter Title
he_il: כותרת סינון על פי מחיר

source: Product Taxonomies
he_il: מאפייני מוצר

source: Add Taxonomy
he_il: הוסף מאפיין

source: No products were found matching your selection.
he_il: לא נמצאו מוצרים התואמים את בחירתכם.

source: All
he_il: הכל
